{"backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["input_3", 0, 0], ["input_2", 0, 0]], "output_layers": [["up_sampling2d_3", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"name": "input_3", "batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "sparse": false}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "filters": 64, "padding": "same", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_204", "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [2, 2], "dilation_rate": [1, 1]}, "name": "conv2d_204", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "filters": 128, "padding": "same", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_205", "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_205", "inbound_nodes": [[["conv2d_204", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "filters": 128, "padding": "same", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_206", "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [2, 2], "dilation_rate": [1, 1]}, "name": "conv2d_206", "inbound_nodes": [[["conv2d_205", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "filters": 256, "padding": "same", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_207", "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_207", "inbound_nodes": [[["conv2d_206", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "filters": 256, "padding": "same", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_208", "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [2, 2], "dilation_rate": [1, 1]}, "name": "conv2d_208", "inbound_nodes": [[["conv2d_207", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "filters": 512, "padding": "same", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_209", "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_209", "inbound_nodes": [[["conv2d_208", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"name": "input_2", "batch_input_shape": [null, 1000], "dtype": "float32", "sparse": false}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "filters": 512, "padding": "same", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_210", "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_210", "inbound_nodes": [[["conv2d_209", 0, 0, {}]]]}, {"class_name": "RepeatVector", "config": {"name": "repeat_vector_1", "trainable": true, "n": 1024}, "name": "repeat_vector_1", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "filters": 256, "padding": "same", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_211", "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_211", "inbound_nodes": [[["conv2d_210", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_1", "target_shape": [32, 32, 1000], "trainable": true}, "name": "reshape_1", "inbound_nodes": [[["repeat_vector_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "name": "concatenate_1", "trainable": true}, "name": "concatenate_1", "inbound_nodes": [[["conv2d_211", 0, 0, {}], ["reshape_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "filters": 768, "padding": "same", "trainable": true, "kernel_size": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_212", "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_212", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "filters": 128, "padding": "same", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_213", "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_213", "inbound_nodes": [[["conv2d_212", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "name": "up_sampling2d_1", "data_format": "channels_last", "trainable": true}, "name": "up_sampling2d_1", "inbound_nodes": [[["conv2d_213", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "filters": 64, "padding": "same", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_214", "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_214", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "name": "up_sampling2d_2", "data_format": "channels_last", "trainable": true}, "name": "up_sampling2d_2", "inbound_nodes": [[["conv2d_214", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "filters": 32, "padding": "same", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_215", "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_215", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "filters": 16, "padding": "same", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_216", "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_216", "inbound_nodes": [[["conv2d_215", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "filters": 2, "padding": "same", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_217", "activation": "tanh", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_217", "inbound_nodes": [[["conv2d_216", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "name": "up_sampling2d_3", "data_format": "channels_last", "trainable": true}, "name": "up_sampling2d_3", "inbound_nodes": [[["conv2d_217", 0, 0, {}]]]}]}, "keras_version": "2.1.5"}